describe TopMenu do
  let(:menu) { TopMenu.new }

  describe '#seasons' do
    subject { menu.seasons }
    it do
      is_expected.to eq(
        [
          ['2016', '2016 год', 'Аниме 2016 года'],
          ['2015', '2015 год', 'Аниме 2015 года'],
          ['winter_2016', 'Зимний сезон', 'Зимний сезон 2016 года'],
          ['fall_2015', 'Осенний сезон', 'Осенний сезон 2015 года'],
          ['summer_2015', 'Летний сезон', 'Летний сезон 2015 года'],
          ['spring_2015', 'Весенний сезон', 'Весенний сезон 2015 года']
        ]
      )
    end
  end
end
